<template>
  <div>
    <div @click="toggle">
      <h1>Библиотека программиста</h1>
    </div>
    <div v-if="isOpen">
      <p>Как водится каждый раз начинаю писать новую библиотеку с кодом :-) посмотрим что выйдет на этот раз</p>
      <p>Идея в том что теперь будет множество раздвижных и всплывающих окон и множество ссылок на GIT с описанием использования.</p>
      <div>
        Буду считать это документацией моей жизненной позиции :-) главная задача грамотно скомпоновать данные и добиться следующих результатов:
        <ul>
          <li>
            Возможность писать свой взгляд на описываемые объекты, 
            давать краткий и развёрнутый комментарии, дать пользователю возможность обращаться к ним, 
            редактировать, возможно обращаться к истории. 
            Главная задача в голове дать пользователю что-то в духе обращения к краткой методичке, краткому комментарию и развёрнотому комментарию на выбор.
          </li>
          <li>
            Сделать интуитивно понятную дизайн и вёрстку, постараться подогнать под разные девайсы.
          </li>
        </ul>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'CurrentLibrary',
  data() {
    return {
      isOpen: false
    }
  },
  methods: {
    toggle() {
      this.isOpen = !this.isOpen;
    }
  }
}
</script>

<style scope>

</style>
