<template>
  <article>
    <p>Как водится каждый раз начинаю писать новую библиотеку с кодом :-) посмотрим что выйдет на этот раз</p>
    <p>Идея в том что теперь будет множество раздвижных и всплывающих окон и множество ссылок на GIT с описанием использования.</p>
    <p>Проект находится в папке <CodeLine>D:\new-year-new-library</CodeLine></p>
    <p>Стянуть с GIT: <CodeLine>git clone https://github.com/NinetiesFiasco/new-year-new-library.git</CodeLine></p>
    <p>Установить <CodeLine>npm i</CodeLine></p>
    <p>Запустить сервер <CodeLine>npm run serve</CodeLine></p>
    <p>Публикация описана в разделе GitHub pages</p>
    <p>Описать скачивание и обновление библиотеки - очень важные штуки, хочу добиться того чтобы возвращение к проекту занимало минимум времени, особенно после смены языка</p>
    <section>
      Буду считать это документацией моей жизненной позиции :-) главная задача грамотно скомпоновать данные и добиться следующих результатов:
      <ul>
        <li>
          Возможность писать свой взгляд на описываемые объекты, 
          давать краткий и развёрнутый комментарии, дать пользователю возможность обращаться к ним, 
          редактировать, возможно обращаться к истории. 
          Главная задача в голове дать пользователю что-то в духе обращения к краткой методичке, краткому комментарию и развёрнотому комментарию на выбор.
        </li>
        <li>
          Сделать интуитивно понятную дизайн и вёрстку, постараться подогнать под разные девайсы.
        </li>
      </ul>
    </section>
    <section>
      <h3>Добавление новой секции</h3>
      <p>
        Нужно внести следующие изменения:
        <ul>
          <li>в Library.vue добавить ссылку на новый адрес</li>
          <li>в router.js привязать новый компонент к адресу</li>
          <li>сделать линк в sections/index.js</li>
          <li>в папке sections добавить новый компонент</li>
        </ul>
      </p>

      <CodeBlocks />
    </section>
  </article>
</template>

<script>
import {CodeLine} from '../commons'
import CodeBlocks from './CodeBlocks.vue'


export default {
  name: 'CurrentLibrary',
  components: {
    CodeLine, CodeBlocks
  }
}
</script>

<style scope>

</style>
