<template>
  <div id="seredin-library">
    <div>
      <h1>Seredin programmer library</h1>
      <p>Как водится каждый раз начинаю писать новую библиотеку с кодом :-) посмотрим что выйдет на этот раз</p>
      <p>Идея в том что теперь будет множество раздвижных и всплывающих окон и множество ссылок на GIT с описанием использования.</p>
    </div>
    <div>
      <h2>GIT</h2>
      <p>
        GIT - система контроля версий, он позволяет хранить свою работу в упорядоченном виде,
        создавать коробочку для каждого отдельного проекта, хранить историю и подключать к разработке других людей и работать с ними параллельно
      </p>
    </div>
  </div>
</template>

<script>
export default {
  name: 'HelloWorld'
}
</script>

<style scoped>
</style>
